-- TEST TRIGGER 1

--  Добавить книгу без указания года.

insert into book(isbn, name, year, edition, volume, l_code, orig_isbn, type, annotation) values
    ('1337','Назв. книги',null,'Назв. издания',null,7,null, 'printed book', 'Аннотация...');

catalogue=# select * from book_v;

--           isbn        |         title          | year |     edition      | volume |     orig_isbn     |      type       | language
--    -------------------+------------------------+------+------------------+--------+-------------------+-----------------+----------
--     978-0-140-1863-90 | East of Eden           | 1952 | Viking Press     |      1 |                   | printed book    | english
--     978-0-140-2816-20 | The Grapes of Wrath    | 1939 | Viking Press     |        |                   | printed book    | english
--     0-552-55273-9     | The Golem Eye          | 2004 | Miramax          |        |                   | electronic book | english
--     978-5-17-102581-9 | К востоку от Эдема (h) | 2017 | Издательство АСТ |      2 | 978-0-140-1863-90 | printed book    | hindi
--     1337              | Назв. книги            | 2021 | Назв. издания    |        |                   | printed book    | russian
--     ...               | ...                    | ..   | ...              |  ..    |  ...              | ...             | ...

insert into book(isbn, name, year, edition, volume, l_code, orig_isbn, type, annotation) values
    ('1444','Назв. книги2',null,'Назв. издания2',null,7,'978-5-9922-1030-9', 'printed book', null);

--    NOTICE:  (before) Аннотация не указана, оригинал есть.(978-5-9922-1030-9)
--    INSERT 0 1

    select * from book where isbn='1444';

--     isbn |       name       | year |    edition     | volume | l_code |     orig_isbn     |                                                                                                         annotation                                                                                                          |     type
--    ------+------------------+------+----------------+--------+--------+-------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------
--     1444 | Верховная Ведьма | 2021 | Назв. издания2 |        |      7 | 978-5-9922-1030-9 | Третья книга цикла о Вольхе завершает историю ее приключений. Ведьма собирается замуж за вампира. Вот только не предсвадебными хлопотами занята невеста. Ей предстоит написать диссертацию, чтобы получить звание магистра. | printed book
--    (1 row)

    select * from author_book;

--     a_i |        b_i
--    -----+-------------------
--     1   | 978-5-9922-1030-9
--     2   | 0-552-55273-9
--     2   | 978-5-6999-4925-0
--     3   | 978-0-140-2816-20
--     3   | 978-5-389-06635-9
--     3   | 978-0-140-1863-90
--     3   | 978-5-17-102580-9
--     2   | 978-5-9922-1030-9
--     1   | 1444
--     2   | 1444
--    (10 rows)

    select * from directory_book;

--           d_n        |        b_i
--    ------------------+-------------------
--     programming      | 978-5-9922-1030-9
--     heroic fantasy   | 978-5-9922-1030-9
--     fantasy          | 0-552-55273-9
--     novel            | 978-0-140-2816-20
--     historical genre | 978-0-140-2816-20
--     novel            | 978-5-389-06635-9
--     historical genre | 978-5-389-06635-9
--     novel            | 978-0-140-1863-90
--     novel            | 978-5-17-102580-9
--     novel            | 978-5-17-102581-9
--     programming      | 1444
--     heroic fantasy   | 1444
--    (12 rows)

